Revit 2027 API
Application.NewProjectDocument(UnitSystem) Method
 Creates a new project document with no template file specified.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document NewProjectDocument(
	UnitSystem unitSystem
)
Public Function NewProjectDocument (
	unitSystem As UnitSystem
) As Document
public:
Document^ NewProjectDocument(
	UnitSystem unitSystem
)
member NewProjectDocument :
        unitSystem : UnitSystem -> Document
Parameters
unitSystem UnitSystem
 The unit system used for the new document.
Return Value
Document
 The newly created document.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Application Class
NewProjectDocument Overload
Autodesk.Revit.ApplicationServices Namespace